# <p style='text-align: center;'> Python 과학 프로그래밍 기초</p>

## <p style='text-align: center;'> 8. Pandas (3)

### <p style='text-align: center;'> 2021년 1학기 </p>
### <p style='text-align: center;'> 한림대학교 소프트웨어융합대학 </p>
### <p style='text-align: center;'> 박섭형 </p>

In [1]:
import numpy as np
import pandas as pd
pd.__version__

'1.1.3'

#### DataFrame의 데이터에 접근하는 일반적 방법
```
dataframe.loc[<row indexer>, <column indexer>]
```

In [2]:
student_record_file_name = "student_records.csv"
scores = pd.read_csv(student_record_file_name)
scores.head()

    이름        학번         소속  시험1  시험2  시험3  시험4  시험5
0  서승운  20235458    콘텐츠IT전공   77   43   93   49   53
1  고도범  20277426  융합소프트웨어학과   67   43   87   52   47
2  김명빈  20324832     컴퓨터공학과   42   75   89   30   58
3  이승훈  20307405     빅데이터전공   46   77   71   56   52
4  안동우  20327385    콘텐츠IT전공   71   83   69   45   89

In [3]:
scores['시험1']

0      77
1      67
2      42
3      46
4      71
5      84
6      47
7      76
8     100
9      96
10     48
11     92
12     54
13     63
14     65
15     78
16     79
17     70
18    100
19     98
20     87
21     84
22     61
23     70
24     50
25     48
26     53
27     97
28     41
29     75
30     57
31     78
32     96
33     60
34     96
35     72
36     68
37     56
38     98
39    100
Name: 시험1, dtype: int64

In [4]:
scores[['시험1', '시험2']]

    시험1  시험2
0    77   43
1    67   43
2    42   75
3    46   77
4    71   83
5    84   89
6    47   72
7    76   90
8   100   57
9    96   82
10   48   87
11   92   67
12   54   82
13   63   79
14   65   46
15   78   43
16   79   64
17   70   70
18  100  100
19   98   50
20   87   91
21   84   78
22   61   53
23   70   96
24   50   48
25   48   41
26   53   58
27   97   69
28   41   95
29   75   43
30   57   42
31   78   72
32   96   96
33   60   44
34   96   48
35   72   65
36   68   85
37   56   57
38   98   72
39  100   41

In [5]:
scores.loc[3]

이름          이승훈
학번     20307405
소속       빅데이터전공
시험1          46
시험2          77
시험3          71
시험4          56
시험5          52
Name: 3, dtype: object

In [6]:
scores.loc[[3, 5]]

    이름        학번       소속  시험1  시험2  시험3  시험4  시험5
3  이승훈  20307405   빅데이터전공   46   77   71   56   52
5  서호근  20287365  콘텐츠IT전공   84   89   50   28   76

In [7]:
scores.loc[3, '시험1']

46

In [8]:
scores.loc[[3,5], ['시험1','시험2']]

   시험1  시험2
3   46   77
5   84   89

In [9]:
scores.loc[3:6, ['시험1','시험2']]

   시험1  시험2
3   46   77
4   71   83
5   84   89
6   47   72

In [10]:
scores.loc[3:6, '시험1':'시험2']

   시험1  시험2
3   46   77
4   71   83
5   84   89
6   47   72

#### Looping over Series

In [11]:
s = scores.loc[3]
type(s)

pandas.core.series.Series

In [12]:
c = scores['시험1']
type(c)

pandas.core.series.Series

In [13]:
for e in s:
    print(e)

이승훈
20307405
빅데이터전공
46
77
71
56
52

In [14]:
for i in s.index:
    print(s[i])

이승훈
20307405
빅데이터전공
46
77
71
56
52

##### Pandas Series 함수

In [15]:
scores.set_index('이름', inplace=True)
scores.head()

           학번         소속  시험1  시험2  시험3  시험4  시험5
이름
서승운  20235458    콘텐츠IT전공   77   43   93   49   53
고도범  20277426  융합소프트웨어학과   67   43   87   52   47
김명빈  20324832     컴퓨터공학과   42   75   89   30   58
이승훈  20307405     빅데이터전공   46   77   71   56   52
안동우  20327385    콘텐츠IT전공   71   83   69   45   89

In [16]:
s = scores.loc['이승훈']
s

학번     20307405
소속       빅데이터전공
시험1          46
시험2          77
시험3          71
시험4          56
시험5          52
Name: 이승훈, dtype: object

In [17]:
c = scores['시험1']
c

이름
서승운     77
고도범     67
김명빈     42
이승훈     46
안동우     71
서호근     84
서기제     47
서승제     76
서준수    100
김경혁     96
이준민     48
장도민     92
이준언     54
최재규     63
김웅빈     65
김제용     78
김동우     79
신진근     70
김휘규    100
정종혁     98
정동기     87
장준근     84
신봉형     61
강영용     70
서도운     50
이승수     48
김기환     53
최정규     97
정예기     41
최성현     75
정재하     57
이재근     78
이웅훈     96
조제기     60
김준혁     96
김성제     72
신정형     68
정고기     56
김현환     98
서도규    100
Name: 시험1, dtype: int64

In [18]:
type(s.loc['시험1'])

numpy.int64

In [19]:
type(s.loc['소속'])

str

##### min(), max(), mean()

In [20]:
c.min(), c.max(), c.mean()

(41, 100, 72.5)

In [21]:
s.min()

TypeError: '<=' not supported between instances of 'numpy.ndarray' and 'str'

In [22]:
scores.min()

학번     20235458
소속       광고홍보학과
시험1          41
시험2          41
시험3          35
시험4          24
시험5          47
dtype: object

In [23]:
 scores['학번'].min(), scores['소속'].min(), scores['시험1'].min()

(20235458, '광고홍보학과', 41)

In [24]:
dir(c1)

NameError: name 'c1' is not defined

##### add(), sub(), substact(), mul(), multiply(), div(), divide(), mod()

In [25]:
d = {'a':[1, 3, 5], 'b':[2,4, np.NaN]}
df1 = pd.DataFrame(d)
df1

   a    b
0  1  2.0
1  3  4.0
2  5  NaN

In [26]:
df1.dtypes

a      int64
b    float64
dtype: object

In [27]:
c1 = df1['a']
c2 = df1['b']

In [28]:
c1 + 3

0    4
1    6
2    8
Name: a, dtype: int64

In [29]:
c1.add(3)

0    4
1    6
2    8
Name: a, dtype: int64

In [30]:
c2 + 2

0    4.0
1    6.0
2    NaN
Name: b, dtype: float64

In [31]:
c2.add(2)

0    4.0
1    6.0
2    NaN
Name: b, dtype: float64

In [32]:
c2.add(2, fill_value=0)

0    4.0
1    6.0
2    2.0
Name: b, dtype: float64

In [33]:
c1.add(c2, fill_value=0)

0    3.0
1    7.0
2    5.0
dtype: float64

In [34]:
c3 = c2.copy()
c3.add(c2, fill_value=0)

0    4.0
1    8.0
2    NaN
Name: b, dtype: float64

In [35]:
d2 = {'a':[1, np.NaN, 5], 'b':[2,4, np.NaN]}
df2 = pd.DataFrame(d2)
df2

     a    b
0  1.0  2.0
1  NaN  4.0
2  5.0  NaN

In [36]:
c3 = df2['a']
c4 = df2['b']

In [37]:
c3.add(c4, fill_value=0)

0    3.0
1    4.0
2    5.0
dtype: float64

In [38]:
c4.add(c3, fill_value=0)

0    3.0
1    4.0
2    5.0
dtype: float64

In [39]:
c3 - c4

0   -1.0
1    NaN
2    NaN
dtype: float64

In [40]:
c3.sub(c4, fill_value=0)

0   -1.0
1   -4.0
2    5.0
dtype: float64

In [41]:
c3.mul(c4, fill_value=0)

0    2.0
1    0.0
2    0.0
dtype: float64

In [42]:
c3.div(c4, fill_value=0)

0    0.5
1    0.0
2    inf
dtype: float64

In [43]:
c3.mod(c4, fill_value=0)

0    1.0
1    0.0
2    NaN
dtype: float64

In [44]:
tdf1 = pd.DataFrame([[1, 2], [3, 4]], 
                    index=['idx1', 'idx2'], 
                    columns=['col1', 'col2'])

In [45]:
tdf1

      col1  col2
idx1     1     2
idx2     3     4

In [46]:
tdf2 = tdf1.copy()
tdf2.index = ['idx2', 'idx3']
tdf2

      col1  col2
idx2     1     2
idx3     3     4

In [47]:
tdf1 + tdf2

      col1  col2
idx1   NaN   NaN
idx2   4.0   6.0
idx3   NaN   NaN

In [48]:
tdf1.add(tdf2)

      col1  col2
idx1   NaN   NaN
idx2   4.0   6.0
idx3   NaN   NaN

In [49]:
tdf3 = tdf1.copy()
tdf3.columns = ['col2', 'col3']
tdf3

      col2  col3
idx1     1     2
idx2     3     4

In [50]:
tdf1 + tdf3

      col1  col2  col3
idx1   NaN     3   NaN
idx2   NaN     7   NaN

In [51]:
tdf1.add(tdf3)

      col1  col2  col3
idx1   NaN     3   NaN
idx2   NaN     7   NaN

##### gt(), ge(), lt(), le(), eq(), equals(), ne()

In [52]:
c3, c4

(0    1.0
 1    NaN
 2    5.0
 Name: a, dtype: float64,
 0    2.0
 1    4.0
 2    NaN
 Name: b, dtype: float64)

In [53]:
c3 < c4

0     True
1    False
2    False
dtype: bool

In [54]:
c3.lt(c4, fill_value=0)

0     True
1     True
2    False
dtype: bool

In [55]:
d3 = {'a': [0, 5, 2], 'b': [1, 10, np.NaN]}
df3 = pd.DataFrame(d3)
df3

   a     b
0  0   1.0
1  5  10.0
2  2   NaN

In [56]:
df2 - df3

     a    b
0  1.0  1.0
1  NaN -6.0
2  3.0  NaN

In [57]:
df2.sub(df3, fill_value=0)

     a    b
0  1.0  1.0
1 -5.0 -6.0
2  3.0  NaN

##### pandas.Series.add_suffix(), pandas.Series.add_prefix(),

In [58]:
s

학번     20307405
소속       빅데이터전공
시험1          46
시험2          77
시험3          71
시험4          56
시험5          52
Name: 이승훈, dtype: object

In [59]:
s.add_suffix('_2030')

학번_2030     20307405
소속_2030       빅데이터전공
시험1_2030          46
시험2_2030          77
시험3_2030          71
시험4_2030          56
시험5_2030          52
Name: 이승훈, dtype: object

In [60]:
s

학번     20307405
소속       빅데이터전공
시험1          46
시험2          77
시험3          71
시험4          56
시험5          52
Name: 이승훈, dtype: object

In [61]:
df2

     a    b
0  1.0  2.0
1  NaN  4.0
2  5.0  NaN

In [62]:
df2.add_suffix('_col')

   a_col  b_col
0    1.0    2.0
1    NaN    4.0
2    5.0    NaN

In [63]:
df2.add_prefix('pre_')

   pre_a  pre_b
0    1.0    2.0
1    NaN    4.0
2    5.0    NaN

In [64]:
s.add_suffix('aaa')

학번aaa     20307405
소속aaa       빅데이터전공
시험1aaa          46
시험2aaa          77
시험3aaa          71
시험4aaa          56
시험5aaa          52
Name: 이승훈, dtype: object

In [65]:
df2.index

RangeIndex(start=0, stop=3, step=1)

#### Missing value 처리 함수
- pandas.DataFrame.dropna
- pandas.DataFrame.fillna
- pandas.DataFrame.interpolate

##### NaN: missing value

In [66]:
np.inf > 10

True

In [67]:
np.inf + 10

inf

In [68]:
np.nan > 10

False

In [69]:
np.inf > np.nan

False

In [70]:
np.nan + 10

nan

In [71]:
df2.dropna()

     a    b
0  1.0  2.0

In [72]:
df2

     a    b
0  1.0  2.0
1  NaN  4.0
2  5.0  NaN

In [73]:
df_tmp = df2.copy()
df_tmp.dropna(inplace=True)
df_tmp

     a    b
0  1.0  2.0

In [74]:
df2.fillna(0)

     a    b
0  1.0  2.0
1  0.0  4.0
2  5.0  0.0

In [75]:
df_tmp = df2.copy()
df_tmp.fillna(0, inplace=True)
df_tmp

     a    b
0  1.0  2.0
1  0.0  4.0
2  5.0  0.0

In [76]:
df_tmp = df2.copy()
df_tmp.interpolate()

     a    b
0  1.0  2.0
1  3.0  4.0
2  5.0  4.0

# <p style='text-align: center;'> Python 과학 프로그래밍 기초</p>

## <p style='text-align: center;'> 8. Pandas (4)

### <p style='text-align: center;'> 2021년 1학기 </p>
### <p style='text-align: center;'> 한림대학교 소프트웨어융합대학 </p>
### <p style='text-align: center;'> 박섭형 </p>

#### Missing value 처리 함수
- pandas.DataFrame.dropna
- pandas.DataFrame.fillna
- pandas.DataFrame.interpolate

#### pandas.DataFrame.replace

In [77]:
df = pd.DataFrame({'col1': [0, 2, 4, 2, 4],
                   'col2': [2, 3, 4, 5, 6],
                   'col3': [1, 3, 2, 4, 9]})
df

   col1  col2  col3
0     0     2     1
1     2     3     3
2     4     4     2
3     2     5     4
4     4     6     9

In [78]:
df == 4

    col1   col2   col3
0  False  False  False
1  False  False  False
2   True   True  False
3  False  False   True
4   True  False  False

In [79]:
df[df == 4] = 14
df

   col1  col2  col3
0     0     2     1
1     2     3     3
2    14    14     2
3     2     5    14
4    14     6     9

In [80]:
df2 = pd.DataFrame({'col1': [0, 2, 4, 2, 4],
                   'col2': list('abcde'),
                   'col3': [1, 3, 2, 4, 9]})
df2

   col1 col2  col3
0     0    a     1
1     2    b     3
2     4    c     2
3     2    d     4
4     4    e     9

In [81]:
df2[df2 == 4] = 14

TypeError: Cannot do inplace boolean setting on mixed-types with a non np.nan value

In [82]:
df.replace(14, 4)

   col1  col2  col3
0     0     2     1
1     2     3     3
2     4     4     2
3     2     5     4
4     4     6     9

In [83]:
df2.replace(4, 14)

   col1 col2  col3
0     0    a     1
1     2    b     3
2    14    c     2
3     2    d    14
4    14    e     9

In [84]:
df2

   col1 col2  col3
0     0    a     1
1     2    b     3
2     4    c     2
3     2    d     4
4     4    e     9

In [85]:
df2.replace(4, 14, inplace=True)
df2

   col1 col2  col3
0     0    a     1
1     2    b     3
2    14    c     2
3     2    d    14
4    14    e     9

#### Pandas 함수 적용

- map(): Series에만 함수 적용
- apply(): 행 또는 열에 함수 적용
- applymap(): 원소 단위에 함수 적용
- pipe(): DataFrame 전체에 함수 적용

##### map(): Series에만 함수 적용

In [86]:
lst = [1, 3, 5]
list(map(lambda x: x**2, lst))

[1, 9, 25]

In [87]:
arr = np.array([1, 3, 5])
arr ** 2

array([ 1,  9, 25], dtype=int32)

In [88]:
c1

0    1
1    3
2    5
Name: a, dtype: int64

In [89]:
c1.map(lambda x: x**2)

0     1
1     9
2    25
Name: a, dtype: int64

In [90]:
df2

   col1 col2  col3
0     0    a     1
1     2    b     3
2    14    c     2
3     2    d    14
4    14    e     9

In [91]:
df2.map(lambda x: x**2)

AttributeError: 'DataFrame' object has no attribute 'map'

##### apply(): 행 또는 열에 함수 적용

In [92]:
df = pd.DataFrame({'col1': [0, 2, 4, 2, 4],
                   'col2': [2, 3, 4, 5, 6],
                   'col3': [1, 3, 2, 4, 9]})
df

   col1  col2  col3
0     0     2     1
1     2     3     3
2     4     4     2
3     2     5     4
4     4     6     9

In [93]:
df.apply(np.sum, axis=0)

col1    12
col2    20
col3    19
dtype: int64

In [94]:
np.sum(df, axis=0)

col1    12
col2    20
col3    19
dtype: int64

In [95]:
df.apply(np.sum, axis=1)

0     3
1     8
2    10
3    11
4    19
dtype: int64

In [96]:
np.sum(df, axis=1)

0     3
1     8
2    10
3    11
4    19
dtype: int64

In [97]:
df.apply(np.sum, axis=0, result_type ='broadcast')

   col1  col2  col3
0    12    20    19
1    12    20    19
2    12    20    19
3    12    20    19
4    12    20    19

In [98]:
df.apply(np.sum, axis=1, result_type ='broadcast')

   col1  col2  col3
0     3     3     3
1     8     8     8
2    10    10    10
3    11    11    11
4    19    19    19

#### applymap(): 원소 단위에 함수 적용

In [99]:
df

   col1  col2  col3
0     0     2     1
1     2     3     3
2     4     4     2
3     2     5     4
4     4     6     9

In [100]:
f1 = lambda x: x**2 + 1
df.applymap(f1)

   col1  col2  col3
0     1     5     2
1     5    10    10
2    17    17     5
3     5    26    17
4    17    37    82

In [101]:
df**2 + 1

   col1  col2  col3
0     1     5     2
1     5    10    10
2    17    17     5
3     5    26    17
4    17    37    82

In [102]:
f2 = lambda x: x**2 + 1 if x % 2 else x**2
df.applymap(f2)

   col1  col2  col3
0     0     4     2
1     4    10    10
2    16    16     4
3     4    26    16
4    16    36    82

In [103]:
df.apply(f2)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [104]:
df.applymap(np.sqrt)

       col1      col2      col3
0  0.000000  1.414214  1.000000
1  1.414214  1.732051  1.732051
2  2.000000  2.000000  1.414214
3  1.414214  2.236068  2.000000
4  2.000000  2.449490  3.000000

In [105]:
df.

SyntaxError: invalid syntax (<ipython-input-105-8c846035e3b5>, line 1)

In [106]:
%%timeit
df.applymap(np.sqrt)

810 µs ± 87.8 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [107]:
%%timeit
df.apply(np.sqrt)

46 µs ± 1.11 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [108]:
852 / 48.5

17.567010309278352

##### pipe(): DataFrame 전체에 함수 적용

In [109]:
df.pipe(f2)

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [110]:
df.pipe(np.sqrt)

       col1      col2      col3
0  0.000000  1.414214  1.000000
1  1.414214  1.732051  1.732051
2  2.000000  2.000000  1.414214
3  1.414214  2.236068  2.000000
4  2.000000  2.449490  3.000000

In [111]:
df

   col1  col2  col3
0     0     2     1
1     2     3     3
2     4     4     2
3     2     5     4
4     4     6     9

In [112]:
f3 = lambda x: x['col1'] * x['col2']

In [113]:
df.pipe(f3)

0     0
1     6
2    16
3    10
4    24
dtype: int64

In [114]:
df['col1'] * df['col2']

0     0
1     6
2    16
3    10
4    24
dtype: int64

In [115]:
%%timeit
df.pipe(f3)

118 µs ± 4.13 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [116]:
%%timeit
df['col1'] * df['col2']

115 µs ± 2.14 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

#### Data set에서 임의의 샘플 추출하기
- pandas.DataFrame.sample

In [117]:
scores.head()

           학번         소속  시험1  시험2  시험3  시험4  시험5
이름
서승운  20235458    콘텐츠IT전공   77   43   93   49   53
고도범  20277426  융합소프트웨어학과   67   43   87   52   47
김명빈  20324832     컴퓨터공학과   42   75   89   30   58
이승훈  20307405     빅데이터전공   46   77   71   56   52
안동우  20327385    콘텐츠IT전공   71   83   69   45   89

In [118]:
scores.sample(10)

           학번       소속  시험1  시험2  시험3  시험4  시험5
이름
최재규  20287394    전자공학과   63   79   71   40  100
강영용  20285526   빅데이터전공   70   96   46   45   90
김준혁  20277417  데이터테크전공   96   48   64   35   87
김동우  20327511    전자공학과   79   64   44   56   56
서도규  20243932  콘텐츠IT전공  100   41   75   28   91
최정규  20297325    러시아학과   97   69   77   53   92
김제용  20287360    전자공학과   78   43   41   24   76
신봉형  20287415   빅데이터전공   61   53   65   55   97
김현환  20274845   금융재무학과   98   72   71   48   84
이준민  20297333  콘텐츠IT전공   48   87   50   44   65

In [119]:
scores.sample(10)

           학번        소속  시험1  시험2  시험3  시험4  시험5
이름
서호근  20287365   콘텐츠IT전공   84   89   50   28   76
서도운  20297418   데이터테크전공   50   48   36   31   77
김준혁  20277417   데이터테크전공   96   48   64   35   87
정예기  20307408    빅데이터전공   41   95   63   63   51
강영용  20285526    빅데이터전공   70   96   46   45   90
정동기  20297460   콘텐츠IT전공   87   91   49   33   73
김기환  20267415  스마트IoT전공   53   58   67   36   88
장준근  20267467   콘텐츠IT전공   84   78   57   46   91
서도규  20243932   콘텐츠IT전공  100   41   75   28   91
정재하  20317337  스마트IoT전공   57   42   84   28   72

In [120]:
scores.sample(frac=0.25)

           학번         소속  시험1  시험2  시험3  시험4  시험5
이름
고도범  20277426  융합소프트웨어학과   67   43   87   52   47
신정형  20287459     빅데이터전공   68   85   36   43   61
서준수  20295450     빅데이터전공  100   57   65   59   82
김제용  20287360      전자공학과   78   43   41   24   76
김준혁  20277417    데이터테크전공   96   48   64   35   87
이웅훈  20317504    콘텐츠IT전공   96   96   95   71   56
신봉형  20287415     빅데이터전공   61   53   65   55   97
이승수  20297411     광고홍보학과   48   41   35   64   86
이준언  20297348   스마트IoT전공   54   82   49   24   71
김경혁  20315508     빅데이터전공   96   82   57   24  100

#### 데이터 정규화

In [121]:
scores.describe()

                 학번         시험1         시험2        시험3        시험4        시험5
count  4.000000e+01   40.000000   40.000000  40.000000  40.000000   40.00000
mean   2.029210e+07   72.500000   67.325000  62.850000  45.350000   72.02500
std    2.052440e+04   18.632753   18.837207  17.015152  13.759006   16.49318
min    2.023546e+07   41.000000   41.000000  35.000000  24.000000   47.00000
25%    2.027750e+07   56.750000   48.000000  49.750000  32.750000   56.75000
50%    2.029147e+07   71.500000   69.500000  63.500000  45.000000   72.50000
75%    2.030551e+07   88.250000   82.250000  72.000000  56.000000   88.00000
max    2.032751e+07  100.000000  100.000000  95.000000  71.000000  100.00000

##### maximum absolute scaling

In [122]:
scores_max_scaled = scores.copy()
columns = ['시험1','시험2','시험3','시험4','시험5']  
# apply normalization techniques
for column in columns:
    _max = scores_max_scaled[column].abs().max()
    scores_max_scaled[column] = scores_max_scaled[column]  / _max
      
scores_max_scaled.describe()

                 학번        시험1        시험2        시험3        시험4        시험5
count  4.000000e+01  40.000000  40.000000  40.000000  40.000000  40.000000
mean   2.029210e+07   0.725000   0.673250   0.661579   0.638732   0.720250
std    2.052440e+04   0.186328   0.188372   0.179107   0.193789   0.164932
min    2.023546e+07   0.410000   0.410000   0.368421   0.338028   0.470000
25%    2.027750e+07   0.567500   0.480000   0.523684   0.461268   0.567500
50%    2.029147e+07   0.715000   0.695000   0.668421   0.633803   0.725000
75%    2.030551e+07   0.882500   0.822500   0.757895   0.788732   0.880000
max    2.032751e+07   1.000000   1.000000   1.000000   1.000000   1.000000

##### min-max scaling

In [123]:
scores_min_max_scaled = scores.copy()
columns = ['시험1','시험2','시험3','시험4','시험5']  
# apply normalization techniques
for column in columns:
    _max = scores_min_max_scaled[column].max()
    _min = scores_min_max_scaled[column].min()
    scores_min_max_scaled[column] = (scores_min_max_scaled[column] - _min) / (_max - _min)
      
scores_min_max_scaled.describe()

                 학번        시험1        시험2        시험3        시험4        시험5
count  4.000000e+01  40.000000  40.000000  40.000000  40.000000  40.000000
mean   2.029210e+07   0.533898   0.446186   0.464167   0.454255   0.472170
std    2.052440e+04   0.315809   0.319275   0.283586   0.292745   0.311192
min    2.023546e+07   0.000000   0.000000   0.000000   0.000000   0.000000
25%    2.027750e+07   0.266949   0.118644   0.245833   0.186170   0.183962
50%    2.029147e+07   0.516949   0.483051   0.475000   0.446809   0.481132
75%    2.030551e+07   0.800847   0.699153   0.616667   0.680851   0.773585
max    2.032751e+07   1.000000   1.000000   1.000000   1.000000   1.000000

##### z-score method

In [124]:
scores_z_scaled = scores.copy()
columns = ['시험1','시험2','시험3','시험4','시험5']  
# apply normalization techniques
for column in columns:
    _mean = scores_z_scaled[column].mean()
    _std = scores_z_scaled[column].std()
    scores_z_scaled[column] = (scores_z_scaled[column] - _mean) / _std
      
scores_z_scaled.describe()

,학번,시험1,시험2,시험3,시험4,시험5
count,4.000000e+01,4.000000e+01,4.000000e+01,4.000000e+01,4.000000e+01,4.000000e+01
mean,2.029210e+07,-1.110223e-17,-9.436896e-17,-1.387779e-17,-1.221245e-16,-3.275158e-16
std,2.052440e+04,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00
min,2.023546e+07,-1.690571e+00,-1.397500e+00,-1.636776e+00,-1.551711e+00,-1.517294e+00
25%,2.027750e+07,-8.452857e-01,-1.025895e+00,-7.699020e-01,-9.157638e-01,-9.261404e-01
50%,2.029147e+07,-5.366893e-02,1.154630e-01,3.820125e-02,-2.543788e-02,2.879978e-02
75%,2.030551e+07,8.452857e-01,7.923149e-01,5.377560e-01,7.740385e-01,9.685821e-01
max,2.032751e+07,1.475896e+00,1.734599e+00,1.889492e+00,1.864233e+00,1.696156e+00

#### pandas.DataFrame.isin을 이용한 데이터 필터링

In [125]:
scores[scores['소속'] == '전자공학과']

           학번     소속  시험1  시험2  시험3  시험4  시험5
이름
최재규  20287394  전자공학과   63   79   71   40  100
김제용  20287360  전자공학과   78   43   41   24   76
김동우  20327511  전자공학과   79   64   44   56   56
신진근  20277479  전자공학과   70   70   54   28   49

In [126]:
scores[(scores['소속'] == '전자공학과') | (scores['소속'] == '빅데이터전공')]

           학번      소속  시험1  시험2  시험3  시험4  시험5
이름
이승훈  20307405  빅데이터전공   46   77   71   56   52
서기제  20315494  빅데이터전공   47   72   61   32   88
서준수  20295450  빅데이터전공  100   57   65   59   82
김경혁  20315508  빅데이터전공   96   82   57   24  100
최재규  20287394   전자공학과   63   79   71   40  100
김웅빈  20304876  빅데이터전공   65   46   65   56   65
김제용  20287360   전자공학과   78   43   41   24   76
김동우  20327511   전자공학과   79   64   44   56   56
신진근  20277479   전자공학과   70   70   54   28   49
정종혁  20267486  빅데이터전공   98   50   57   63   54
신봉형  20287415  빅데이터전공   61   53   65   55   97
강영용  20285526  빅데이터전공   70   96   46   45   90
정예기  20307408  빅데이터전공   41   95   63   63   51
신정형  20287459  빅데이터전공   68   85   36   43   61

In [127]:
scores['소속'].isin(['전자공학과', '빅데이터전공'])

이름
서승운    False
고도범    False
김명빈    False
이승훈     True
안동우    False
서호근    False
서기제     True
서승제    False
서준수     True
김경혁     True
이준민    False
장도민    False
이준언    False
최재규     True
김웅빈     True
김제용     True
김동우     True
신진근     True
김휘규    False
정종혁     True
정동기    False
장준근    False
신봉형     True
강영용     True
서도운    False
이승수    False
김기환    False
최정규    False
정예기     True
최성현    False
정재하    False
이재근    False
이웅훈    False
조제기    False
김준혁    False
김성제    False
신정형     True
정고기    False
김현환    False
서도규    False
Name: 소속, dtype: bool

In [128]:
scores[scores['소속'].isin(['전자공학과', '빅데이터전공'])]

           학번      소속  시험1  시험2  시험3  시험4  시험5
이름
이승훈  20307405  빅데이터전공   46   77   71   56   52
서기제  20315494  빅데이터전공   47   72   61   32   88
서준수  20295450  빅데이터전공  100   57   65   59   82
김경혁  20315508  빅데이터전공   96   82   57   24  100
최재규  20287394   전자공학과   63   79   71   40  100
김웅빈  20304876  빅데이터전공   65   46   65   56   65
김제용  20287360   전자공학과   78   43   41   24   76
김동우  20327511   전자공학과   79   64   44   56   56
신진근  20277479   전자공학과   70   70   54   28   49
정종혁  20267486  빅데이터전공   98   50   57   63   54
신봉형  20287415  빅데이터전공   61   53   65   55   97
강영용  20285526  빅데이터전공   70   96   46   45   90
정예기  20307408  빅데이터전공   41   95   63   63   51
신정형  20287459  빅데이터전공   68   85   36   43   61